app/Http/Controllers/RoomsController.php

    public function index()
    {
        return view('salles/index', [
            // Movie::all() fonctionne mais moins optimisé
            'rooms' => Room::all(),
---
select * from `rooms`